app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-04-08 14:56:07.320121"], ["updated_at", "2018-04-08 14:56:07.320121"]]
---
  def create
    @post = Post.create(title: params[:title], description: params[:description])